/**********************************************************************************************
 * @file      ModelAnimationSystem.h
 * @brief     アニメーション制御システム
 *
 * @author    浅野勇生
 * @date      2025/11/27
 *
 * =============================================================================================
 *  Progress Log  - 進捗ログ
 * ---------------------------------------------------------------------------------------------
 *  [ @date 2025/11/27 ]
 * 
 *    - [◎] 〇〇を実装
 *    - [] △△のバグ調査中
 *
 **********************************************************************************************/
#pragma once

#include "ECS/Systems/IUpdateSystem.h"

class ModelAnimationSystem : public IUpdateSystem
{
public:
    void Update(class World& world, float dt) override;
};