/**********************************************************************************************
 * @file      RankingDigitUIComponent.h
 * @brief     数字用UIコンポーネント
 *
 * @author    浅野勇生
 * @date      2025/12/2
 *
 * =============================================================================================
 *  Progress Log  - 進捗ログ
 * ---------------------------------------------------------------------------------------------
 *  [ @date 2025/12/2 ]
 * 
 *    - [◎] RankingDigitUIComponent作成
 *
 **********************************************************************************************/
#pragma once

struct RankingDigitUIComponent
{
    // 0..5 (最大6行)
    int row = 0;

    enum class Type
    {
        MinTens,
        MinOnes,
        Separator, // コロン用 (= インデックス10)
        SecTens,
        SecOnes,
    } type = Type::MinTens;
};