/**********************************************************************************************
 * @file      PrefabCountdownUI.h
 * @brief     カウントダウンUIプレハブ
 *
 * @author    浅野勇生
 * @date      2025/12/4
 *
 * =============================================================================================
 *  Progress Log  - 進捗ログ
 * ---------------------------------------------------------------------------------------------
 *  [ @date 2025/12/4 ]
 * 
 *    - [◎] RegisterCountdownUIPrefab関数作成
 *
 **********************************************************************************************/
#pragma once
#include "ECS/Prefabs/PrefabRegistry.h"

void RegisterCountdownUIPrefab(PrefabRegistry& registry);
