/**********************************************************************************************
 * @file      PrefabUIOverlay.h
 * @brief     プレファブ：UIオーバーレイ登録ヘッダ
 *
 * @author    浅野勇生
 * @date      2025/12/5
 *
 * =============================================================================================
 *  Progress Log  - 進捗ログ
 * ---------------------------------------------------------------------------------------------
 *  [ @date 2025/12/5 ]
 * 
 *    - [◎] RegisterUIOverlayPrefab関数作成
 *
 **********************************************************************************************/
#pragma once
#include "ECS/Prefabs/PrefabRegistry.h"

void RegisterUIOverlayPrefab(PrefabRegistry& registry);