/**********************************************************************************************
 * @file      EffectSlotsComponent.h
 * @brief     エフェクトのプリセットスロットを保持するコンポーネント
 *
 * @author    浅野勇生
 * @date      2025/11/27
 *
 * =============================================================================================
 *  Progress Log  - 進捗ログ
 * ---------------------------------------------------------------------------------------------
 *  [ @date 2025/11/27 ]
 * 
 *    - [◎] 〇〇を実装
 *    - [] △△のバグ調査中
 *
 **********************************************************************************************/
#pragma once

#include "System/AssetManager.h"

struct EffectSlotsComponent
{
    AssetHandle<EffectRef> onJump;   // ジャンプ時
    AssetHandle<EffectRef> onBlink;  // ブリンク時
    AssetHandle<EffectRef> onDash;   // ダッシュ時
    AssetHandle<EffectRef> onLand;   // 着地時
};
